{"title":"Atomicast","description":"Just a couple guys sitting in a garage, enjoying whiskey and talking about pop culture, alcohol, news, religion, and whatever else strikes our fancy at the moment. Coming live from Peoria, Illinois. ","link":"http:\/\/atomicast.com\/","bimage":"http:\/\/atomicast.com\/images\/itunes_image.jpg","email":"atomicast1@gmail.com","item":[{"title":"Put 'em on that table","description":" The most jam-packed hour we've had so far. Shea actually performs pretty well on a quiz. Russia hates gays and especially Tim Cook, but that doesn't stop us from discussing the Apple Watch. 4chan is a messed up website with at least a few murderers.We dive deep into the NFL Cheerleader recently caught statutorily raping a 15-year-old. Our song this week is by Post Modern Jukebox and it features a mashup of a bunch of stuff.As usual, join us live on Wednesdays nights at 9ish CST, follow us on all the social media stuff at atomicast.com and leave us a voicemail at 832-819-3867. ","pubdate":"November 6th, 2014","guid":"http:\/\/atomicast.com\/#\/Season3Ep12\/","enclosure":"http:\/\/media.blubrry.com\/atomicast\/atomicast.com\/media\/Season3Ep12.mp3","image":"http:\/\/atomicast.com\/images\/Season3Ep12.jpg","pid":0},{"title":"Horror Junk","description":" We have a special guest tonight from the Drunken Zombie Podcast Network, talking about all sorts of scary stuff in celebration of Halloween. We're drinking Hallowine, reminiscing on our previous podcasts and focusing on all things horror for Episode 11.We start off going over our podcast history which started with Horror Junk. Shea quizzes Bryan and Tim about some of our older episodes and Tim does better than expected. Bryan also does better than expected identifying songs from John Carpenter music. Shea covers a group of lesser-known serial killers and Tim scatters in some unsolved and creepy mysteries throughout. We wrap up with the show going totally off the rails in the last 30 minutes or so.  ","pubdate":"October 30th, 2014","guid":"http:\/\/atomicast.com\/#\/Season3Ep11\/","enclosure":"http:\/\/media.blubrry.com\/atomicast\/atomicast.com\/media\/Season3Ep11.mp3","image":"http:\/\/atomicast.com\/images\/Season3Ep11.jpg","pid":1},{"title":"X","description":" Ten episodes in. We're drinking a homebrewed red. Tim and Shea both have interesting driving stories. We decipher backwards songs and find Satan's messages in them. We review the world's most mysterious sounds. Vegetarianism lowers sperm count? Maybe.The song this week is a Katy Perry cover of Hot and Cold by Red Summer Tape.Next week is our super-special Halloween episode, so tune in to http:\/\/radio.atomicast.com at 9PM CST. Call the voicemail at 832-819-3867 or email us at atomicast1@gmail.com. ","pubdate":"October 22nd, 2014","guid":"http:\/\/atomicast.com\/#\/Season3Ep10\/","enclosure":"http:\/\/media.blubrry.com\/atomicast\/atomicast.com\/media\/Season3Ep10.mp3","image":"http:\/\/atomicast.com\/images\/Season3Ep10.jpg","pid":2},{"title":"Love Potion Number Nine","description":" Shea totally blows a quiz on none-singing celebrities who try to sing, but Tim also blows a quiz on horror movie. We talk about the traitor Edward Snowden, 10-year-olds with murderous tendencies and try to discuss neutron stars.Shea breaks the October drinking ban and Tim succumbs to peer pressure. Our song this week is a cover of Sexy and I Know It. We broadcast live on Wednesdays at 9PM central. Leave us voicemail at 832-819-3867 and follow us on all the social media crap. Find links to all that on atomicast.com. ","pubdate":"October 15th, 2014","guid":"http:\/\/atomicast.com\/#\/Season3Ep9\/","enclosure":"http:\/\/media.blubrry.com\/atomicast\/atomicast.com\/media\/Season3Ep9.mp3","image":"http:\/\/atomicast.com\/images\/Season3Ep9.jpg","pid":3},{"title":"Atomic Weight of Eight","description":" We're taking a few weeks off from the booze after overdoing it. Instead we talk about 80s and 90s rap songs from movies, sounds from space, baby boomers and how they've ruined the economy for young people, and of course masturbatory euphemisms.Our song this week is F*** 'em if They Can't Take a Joke by exhibitionist Paul Weiner. Shea and Tim are over their heads with political and economic talks, but that doesn't stop them from trying to talk about it intelligently.As usual, we broadcast live on Wednesday nights. Contact the show at atomicast1@gmail.com or call us at 832-819-3867. ","pubdate":"October 8th, 2014","guid":"http:\/\/atomicast.com\/#\/Season3Ep8\/","enclosure":"http:\/\/media.blubrry.com\/atomicast\/atomicast.com\/media\/Season3Ep8.mp3","image":"http:\/\/atomicast.com\/images\/Season3Ep8.jpg","pid":4},{"title":"Lucky Number Seven","description":" Lucky Number Seven. We shoulda broadcast fro Vegas. Instead we talk Ireland, stout beers, and Sam Adams. Shea does poorly on identifying characters in our quiz. Tim tries to name some sex positions. We critique a private conversation held between robots.Tim is remarkably close to a birthday and not handling well. Shea does not help him cope. This episode features possibly the worst intro we've played so far. As usual, we broadcast live on Wednesdays at 9:00 central. Email or call if you want to. 832-819-3867. atomicast1@gmail.com ","pubdate":"October 1st, 2014","guid":"http:\/\/atomicast.com\/#\/Season3Ep7\/","enclosure":"http:\/\/media.blubrry.com\/atomicast\/atomicast.com\/media\/Season3Ep7.mp3","image":"http:\/\/atomicast.com\/images\/Season3Ep7.jpg","pid":5},{"title":"Sexy Six","description":" September 22, 2004. A Lost quiz. A horror movie quiz. Tim is drunk. Shea is condescending. Way too many animal noises mixed in. We broadcast live on Wednesdays, tune in on Wednesdays at 9:00 CST. We're free-flowin' this week. Deal with it. ","pubdate":"September 27th, 2014","guid":"http:\/\/atomicast.com\/#\/Season3Ep6\/","enclosure":"http:\/\/media.blubrry.com\/atomicast\/atomicast.com\/media\/Season3Ep6.mp3","image":"http:\/\/atomicast.com\/images\/Season3Ep6.jpg","pid":6},{"title":"Victorious Volume","description":" We're back with our volumes leveled and audio issues resolved. We drink some Poor Man's Pappy and dive into deep discussions about Republicans, Irritable Male Syndrome, and play to see how many TV shows we can identify by theme song. Spoiler: not many. Tim waxes on about his midlife crisis and irritable week. Shea does little to console him. We do a bit of tech talk on the recent release of iOS 8 and base fundamentalist Christians for their nonsense.  ","pubdate":"September 17th, 2014","guid":"http:\/\/atomicast.com\/#\/Season3Ep5\/","enclosure":"http:\/\/media.blubrry.com\/atomicast\/atomicast.com\/media\/Season3Ep5.mp3","image":"http:\/\/atomicast.com\/images\/Season3Ep5.jpg","pid":7},{"title":"Too Tech Four You","description":" Maybe we got a little carried away this week with news from Samsung, Apple, and of course The Fappening. But this show isn't entirely tech. We also cover sharks, our favorite porn sites and a bunch of other random stuff.According to our biggest fan, this episode is apparently not as funny as previous episodes.Listen to us live on Wednesdays at 9PM Central at http:\/\/radio.atomicast.com. ","pubdate":"September 3rd, 2014","guid":"http:\/\/atomicast.com\/#\/Season3Ep4\/","enclosure":"http:\/\/media.blubrry.com\/atomicast\/atomicast.com\/media\/Season3Ep4.mp3","image":"http:\/\/atomicast.com\/images\/Season3Ep4.jpg","pid":8},{"title":"Three and Free","description":" Shea isn't drinking but Tim picks up the slack. We talk yet again about life on other planets and the habitable zone, airline seats, the Duggars, young mothers, pickup lines, and a somewhat disappointing round of hypothetical questions. Broadcasting live! ","pubdate":"August 27th, 2014","guid":"http:\/\/atomicast.com\/#\/Season3Ep3\/","enclosure":"http:\/\/media.blubrry.com\/atomicast\/atomicast.com\/media\/Season3Ep3.mp3","image":"http:\/\/atomicast.com\/images\/Season3Ep3.jpg","pid":9},{"title":"Two Too Few","description":" So what's up with Frane Selak anyway? How many Bud Lights can normal men drink while podcasting? What about Neptune's moons? These questions, plus hitchhiking robots, Ferguson, police brutality, a Robin Williams interview, and ice bucket mania. Listen up. ","pubdate":"August 23rd, 2014","guid":"http:\/\/atomicast.com\/#\/Season3Ep2\/","enclosure":"http:\/\/media.blubrry.com\/atomicast\/atomicast.com\/media\/Season3Ep2.mp3","image":"http:\/\/atomicast.com\/images\/Season3Ep2.png","pid":10},{"title":"One and Done","description":" In Season 3, Episode one we talk Scientology, Jonestown, and other religious cults. We also dive into pseudo-science as well as two idiots can talk about science. Black holes, dinosaurs, and gravity. Oh my. Please excuse the dust. We're still building.In addition to all of the fun above, we also play a song by 1209 Towanda. ","pubdate":"August 21st, 2014","guid":"http:\/\/atomicast.com\/#\/Season3Ep1\/","enclosure":"http:\/\/media.blubrry.com\/atomicast\/atomicast.com\/media\/Season3Ep1.mp3","image":"http:\/\/atomicast.com\/images\/Season3Ep1.png","pid":11}]}